techporia23-main/app/Controllers/MainController.php

SELECT `data_tim`.`tim_id`, `nama_tim`
FROM `anggota_tim`
LEFT JOIN `data_tim` ON `data_tim`.`tim_id`=`anggota_tim`.`tim_id`
LEFT JOIN `kompetisi` ON `kompetisi`.`id_kompetisi`=`data_tim`.`id_kompetisi`
WHERE `nama_kompetisi` LIKE 'bu%' ESCAPE '!'
AND `anggota` = 'aaa'
 LIMIT 1
---
    public function kompetisi($kompetisi)
    {
        if (auth()->loggedIn()) {
            $anggotaTimModel = new AnggotaTimModel();
            $data = $anggotaTimModel->select('data_tim.tim_id, nama_tim')
                ->join('data_tim', 'data_tim.tim_id=anggota_tim.tim_id', 'left')
                ->join('kompetisi', 'kompetisi.id_kompetisi=data_tim.id_kompetisi', 'left')
                ->like('nama_kompetisi', substr($kompetisi, 0, 2), 'after')
                ->where('anggota', auth()->user()->username)->first();