techporia23-main/app/Controllers/PaymentController.php

    public function lomba($id)
    {
        $fee = 75000; // Default fee if no competition is matched
        $gross_amount = $fee + 4440; // Default gross amount

        $anggotaTimModel = new AnggotaTimModel();
        $check = $anggotaTimModel->where('anggota', auth()->user()->username)
            ->where('tim_id', $id)->first();

        if (!$check) {
            return redirect()->to('/profile');
        }

        $dataTimModel = new DataTimModel();
        $dataTim = $dataTimModel->find($id);

        if (!$dataTim) {
            return redirect()->to('/daftar-lomba');
        }

        $userDataModel = new UserDataModel();
        $user = $userDataModel->find(auth()->user()->username);
        $name = $this->splitName($user['nama']);

        $kompetisiModel = new KompetisiModel();
        $kompetisi = $kompetisiModel->select('nama_kompetisi')->where('id_kompetisi', $dataTim['id_kompetisi'])->first();

        $transactionsModel = new TransactionsModel();
        $transaction = $transactionsModel->where('order_id', $dataTim['order_id'])->first();
---
SELECT *
FROM `anggota_tim`
WHERE `anggota` = 'aaa'
AND `tim_id` = '3060f4'
 LIMIT 1
SELECT *
FROM `data_tim`
WHERE `data_tim`.`tim_id` = '3060f4'
SELECT *
FROM `user_data`
WHERE `user_data`.`username` = 'aaa'
SELECT `nama_kompetisi`
FROM `kompetisi`
WHERE `id_kompetisi` = '6'
 LIMIT 1
SELECT *
FROM `transactions`
WHERE `order_id` = '1580272865669a'
 LIMIT 1


            $snapToken = Snap::getSnapToken($transactionData);

            $transactionsModel->insert([
                'order_id' => $dataTim['order_id'],
                'gross_amount' => $gross_amount,
                'snap_token' => $snapToken,
                'transaction_time' => date('Y-m-d H:i:s'),
                'expiry_time' => date('Y-m-d H:i:s', strtotime('+1 days')),
                'transaction_status' => 'not_start',
            ]);

            $transaction = $transactionsModel->where('order_id', $dataTim['order_id'])->first();
---
INSERT INTO `transactions` (`order_id`, `gross_amount`, `snap_token`, `transaction_time`, `expiry_time`, `transaction_status`) VALUES ('1580272865669a', 54440, 'cc1ab950-0817-4b46-9adc-31bb09e9cdef', '2024-07-19 19:19:41', '2024-07-20 19:19:41', 'not_start')
SELECT *
FROM `transactions`
WHERE `order_id` = '1580272865669a'
 LIMIT 1